# # PROBLEM 4:
# # Что больше:
#
# print((17*3) < (12*5))
# print((12**3) > (13*7))
# print((4**5) == (512+512))
#
#
# # PROBLEM 1:
# # Что больше или равно числа 17925:
#
# print(17925 <= (34**2))
# print(17925 <= (26*3))
# print(17925 <= (17*33))
# print(17925 <= (4394*4))
#
# # PROBLEM 3:
# # Составить выражение:
# # Сложить 2 любых числа
# # Умножить их на любое число
# # Возвести в квадрат
# # Отнять от всего результат: 193432
#
# a = 4 + 5
# a = a * 5
# a = a ** 2
# a = a - 193432
# print(a)
#
#
# # PROBLEM 2:
# # Создайте 4 условия:
# # 1.Число А больше В но меньше С.
# # 2. Результат деления по модулю числа 7 на 3 умножить на 4.8
# # 3.Создать два разных выражения которые равны друг другу.
# # 4. Создать 2 выражения которые  НЕ равны друг другу
#
# a = 10
# b = 5
# c = 15
#
# d = 7 % 3
# d = d * 4.8
#
# e = 2+3
# f = 7-2
#
# j = 4+4
# s = 34+43


# PROBLEM 5:
# Чему равен пример
# -21//10
# print(-21//10)

# PROBLEM 9:
# Создать 2 переменные.
# В первой год вашего рождения, Во второй
# 2020 год
# посчитайте сколько лет вам должно быть через 2 года/и сколько лет вам было два года назад
# a = 1998
# b = 2020
# print(b-a+2, b-a-2)
#
# # PROBLEM 8:
# a = 2021
# b = 2061
# c = (a/b)*100
# print(c)

# PROBLEM 10:
# Найдите средне арифмитическое чисел:25, 75, 10, 95.
# a = (25 + 75 + 10 + 95)/4
# print(a)


# PROBLEM 17:
# Создать 3 переменные в которых лежат 3 одинаковых числа с плавающей точкой.
# Первые 2 переменные между собой сложить и умножить на 3 переменную.


# a = 4.22
# b = 42.2
# c = 422.0
# d = a+b
# e = d*3
# print(d)
# print(e)

# PROBLEM 14:
# Создать 5 переменных:
# a.Чётное число
# b.Любое от 5 до 15
# c.Дробное число до 20
# d.Любое нечётное число
# e.Любое число

# a = 10
# b = 6
# c = 4.2
# d = 11
# e = 16
#
# # PROBLEM 13:
# # Из Задания 3:
# # Составить выражение:
# # (a-e**(b/d))%c
#
# num_1 = 24
# num_2 = 45
# num_3 = 3
# num_5 = 193432
# res = (num_1 - num_2 **(num_3 / num_5))%2
# print(res)